{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_8", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 44, "output_dim": 512, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_8", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_16", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_16", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_16", "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_17", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_17", "inbound_nodes": [[["bidirectional_16", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "name": "add_8", "inbound_nodes": [[["bidirectional_16", 0, 0, {}], ["bidirectional_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "N", "trainable": true, "dtype": "float32", "axis": -1}, "name": "N", "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "D", "trainable": true, "dtype": "float32", "axis": -1}, "name": "D", "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "S", "trainable": true, "dtype": "float32", "axis": -1}, "name": "S", "inbound_nodes": [[["dense_26", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["N", 0, 0], ["D", 0, 0], ["S", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0003000000142492354, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "bidirectional_16/forward_lstm_16/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/forward_lstm_16/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_16/backward_lstm_16/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/forward_lstm_17/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_17/backward_lstm_17/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_24/kernel", "shape": [256, 16], "dtype": "float32"}, {"name": "dense_24/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_25/kernel", "shape": [256, 3], "dtype": "float32"}, {"name": "dense_25/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_26/kernel", "shape": [256, 4], "dtype": "float32"}, {"name": "dense_26/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_8/embeddings", "shape": [44, 512], "dtype": "float32"}]}]}